Tekla Open API Reference for Tekla Structures 2025
FacetedBrep Constructor (Vector[], Int32[][], IDictionary<Int32, Int32[][]>)
 Initializes a new instance of the FacetedBrep class.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FacetedBrep(
	Vector[] vertices,
	int[][] outerWires,
	IDictionary<int, int[][]> innerWires
)
Public Sub New (
	vertices As Vector(),
	outerWires As Integer()(),
	innerWires As IDictionary(Of Integer, Integer()())
)
Parameters
vertices
Type: Tekla.Structures.Geometry3d.Vector[]
Vector of the faceted brep vertices.
outerWires
Type: System.Int32[][]
outerWires is an array of integer arrays, providing indices in the traversing order for each outer loop/wire. The indices correspond to the position of a vertex in the vertices array."
innerWires
Type: System.Collections.Generic.IDictionary<Int32, Int32[][]>
innerWires is an array of integer arrays, providing indices in the traversing order for each inner loop/wire. The dictionary key for the innerWires is the Face index (0-origin). The indices correspond to the position of a vertex in the vertices array."
See Also
Reference
FacetedBrep Class
FacetedBrep Overload
Tekla.Structures.Geometry3d Namespace